bench/results/nginx/fsA_f64k_diag2.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f64k.bin
Document Length:        65536 bytes

Concurrency Level:      1
Time taken for tests:   4.863 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      131576000 bytes
HTML transferred:       131072000 bytes
Requests per second:    411.28 [#/sec] (mean)
Time per request:       2.431 [ms] (mean)
Time per request:       2.431 [ms] (mean, across all concurrent requests)
Transfer rate:          26423.20 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    2  22.8      0     239
Waiting:        0    0   0.0      0       0
Total:          0    2  22.8      0     239

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%    239 (longest request)