bench/results/nginx/fsA_f64k_diag3.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f64k.bin
Document Length:        65536 bytes

Concurrency Level:      1
Time taken for tests:   0.600 seconds
Complete requests:      600
Failed requests:        0
Total transferred:      39472800 bytes
HTML transferred:       39321600 bytes
Requests per second:    999.46 [#/sec] (mean)
Time per request:       1.001 [ms] (mean)
Time per request:       1.001 [ms] (mean, across all concurrent requests)
Transfer rate:          64211.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    1  13.7      0     240
Waiting:        0    0   0.0      0       0
Total:          0    1  13.7      0     240

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      0
 100%    240 (longest request)