bench/results/nginx/fsB_f48k_c8_ka.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f48k.bin
Document Length:        49152 bytes

Concurrency Level:      8
Time taken for tests:   0.400 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    5000
Total transferred:      247040000 bytes
HTML transferred:       245760000 bytes
Requests per second:    12494.41 [#/sec] (mean)
Time per request:       0.640 [ms] (mean)
Time per request:       0.080 [ms] (mean, across all concurrent requests)
Transfer rate:          602855.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    1   0.0      1       1
Waiting:        0    1   0.0      1       1
Total:          0    1   0.0      1       1

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      1 (longest request)