bench/results/nginx/fsB_f64k_c8.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f64k.bin
Document Length:        65536 bytes

Concurrency Level:      8
Time taken for tests:   0.286 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      131576000 bytes
HTML transferred:       131072000 bytes
Requests per second:    6994.72 [#/sec] (mean)
Time per request:       1.144 [ms] (mean)
Time per request:       0.143 [ms] (mean, across all concurrent requests)
Transfer rate:          449383.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   5.3      1     238
Waiting:        0    0   0.1      0       1
Total:          1    1   5.3      1     238

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%    238 (longest request)